{"text": " This recording is from the British Council. Hello? Junco Mori speaking. How can I help you? Hi Junco. It's Andrea here from Red Band. I'm calling about our latest order. Everything arrived okay, right? We got the delivery confirmation at our end. Yes, everything's fine with the order. I'm calling about the invoice and the payment terms. I need a favor. A favor? What do you need? This is a little difficult, but I need an extension on the payment terms. I know they're usually 30 days, but we're having some cash flow problems. You'd really be helping us out if you could extend it to 60 days. I'm not sure if I can do the Andrea. We've got regulations at our end and also have to manage our own cash flow. I promise this won't become the norm, Junco. Actually, I also want to place another new order. The same size order as last time. It's for an important customer and they pay on delivery. I see. So your cash flow problem will be solved after this new order is delivered. That sounds good. Hold on Andrea. Let me see what I can do. Yes, I think we can make an exception this time. That's great, Junco. I appreciate your help. And we appreciate your business, Andrea. It works both ways. Thanks again, Junco. Can you send me a quick email confirmation of the payment terms extension? Sure. No problem. We're happy to help you. Great. And I'll email you the new order. Thanks. I'll keep an eye out for it. Talk to you soon. You too. Goodbye. I'm Scott Ogg, forward slash Learn English.", "segments": [{"start": 0.0, "end": 3.0, "text": "This recording is from the British Council.", "speaker": null}, {"start": 11.0, "end": 15.0, "text": "Hello? Junco Mori speaking. How can I help you?", "speaker": null}, {"start": 16.0, "end": 21.0, "text": "Hi Junco. It's Andrea here from Red Band. I'm calling about our latest order.", "speaker": null}, {"start": 22.0, "end": 27.0, "text": "Everything arrived okay, right? We got the delivery confirmation at our end.", "speaker": null}, {"start": 27.0, "end": 34.0, "text": "Yes, everything's fine with the order. I'm calling about the invoice and the payment terms. I need a favor.", "speaker": null}, {"start": 35.0, "end": 37.0, "text": "A favor? What do you need?", "speaker": null}, {"start": 38.0, "end": 45.0, "text": "This is a little difficult, but I need an extension on the payment terms.", "speaker": null}, {"start": 46.0, "end": 50.0, "text": "I know they're usually 30 days, but we're having some cash flow problems.", "speaker": null}, {"start": 51.0, "end": 54.0, "text": "You'd really be helping us out if you could extend it to 60 days.", "speaker": null}, {"start": 54.0, "end": 63.0, "text": "I'm not sure if I can do the Andrea. We've got regulations at our end and also have to manage our own cash flow.", "speaker": null}, {"start": 64.0, "end": 70.0, "text": "I promise this won't become the norm, Junco. Actually, I also want to place another new order.", "speaker": null}, {"start": 71.0, "end": 76.0, "text": "The same size order as last time. It's for an important customer and they pay on delivery.", "speaker": null}, {"start": 77.0, "end": 83.0, "text": "I see. So your cash flow problem will be solved after this new order is delivered.", "speaker": null}, {"start": 84.0, "end": 90.0, "text": "That sounds good. Hold on Andrea. Let me see what I can do.", "speaker": null}, {"start": 91.0, "end": 95.0, "text": "Yes, I think we can make an exception this time.", "speaker": null}, {"start": 96.0, "end": 99.0, "text": "That's great, Junco. I appreciate your help.", "speaker": null}, {"start": 100.0, "end": 105.0, "text": "And we appreciate your business, Andrea. It works both ways.", "speaker": null}, {"start": 106.0, "end": 111.0, "text": "Thanks again, Junco. Can you send me a quick email confirmation of the payment terms extension?", "speaker": null}, {"start": 111.0, "end": 115.0, "text": "Sure. No problem. We're happy to help you.", "speaker": null}, {"start": 116.0, "end": 119.0, "text": "Great. And I'll email you the new order.", "speaker": null}, {"start": 120.0, "end": 123.0, "text": "Thanks. I'll keep an eye out for it. Talk to you soon.", "speaker": null}, {"start": 124.0, "end": 126.0, "text": "You too. Goodbye.", "speaker": null}, {"start": 141.0, "end": 145.0, "text": "I'm Scott Ogg, forward slash Learn English.", "speaker": null}]}